src/Catalogs/ЗаписиКалендаряПодготовкиОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ЗаписиКалендаряПодготовкиОтчетности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСменыСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобытиеКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендарьПодготовкиОтчетности</v8:Type>
						<v8:Type>cfg:CatalogRef.КалендарьПерсональныхЗадачОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытийКалендаря</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоТочныйРасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСуммыНалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/СостоянияСобытийКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СостоянияСобытийКалендаря</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заполнить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассчитать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уплатить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распечатать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сохранить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарегистрироватьУплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучитьПодтверждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНачато</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомиться</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетНеСдан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ЗаписиКалендаряПодготовкиОтчетности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьЗаписьКалендаря(Организация, СобытиеКалендаря) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаписиКалендаряПодготовкиОтчетности.Ссылка
	|ИЗ
	|	Справочник.ЗаписиКалендаряПодготовкиОтчетности КАК ЗаписиКалендаряПодготовкиОтчетности
	|ГДЕ
	|	ЗаписиКалендаряПодготовкиОтчетности.Организация = &Организация
	|	И ЗаписиКалендаряПодготовкиОтчетности.СобытиеКалендаря = &СобытиеКалендаря
	|	И НЕ ЗаписиКалендаряПодготовкиОтчетности.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СобытиеКалендаря", СобытиеКалендаря);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИмяФормыПоЗадачеИСостоянию(Задача, Состояние) Экспорт
	
	Если Состояние = Перечисления.СостоянияСобытийКалендаря.НеНачато
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Заполнить
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Проверить
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Рассчитать
		ИЛИ Состояние = Перечисления.СостоянияСобытийКалендаря.Сформировать Тогда
		Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ОписанияЗадачИСтартВыполнения";
	Иначе
		
		Если Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.АвансовыйПлатежПоУСН Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.АвансовыйПлатежПоУСН";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ЕдиныйНалогЕНВД Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ЕдиныйНалогЕНВД";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.НалогиСотрудников Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогиСотрудников";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ЕдиныйНалог Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ЕдиныйНалог";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыИП Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СтраховыеВзносыИП";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300ТР Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СтраховыеВзносыПриДоходахСвыше300ТР";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ДекларацияПоУСН Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ДекларацияПоУСН";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ДекларацияПоЕНВД Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ДекларацияПоЕНВД";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ОтчетностьВПФР Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ОтчетностьВПФР";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Справки2НДФЛ Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Справки2НДФЛ";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СреднесписочнаяЧисленность Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СведенияОСреднесписочнойЧисленности";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Форма4ФСС Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма4ФСС";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.НалогПатент Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.НалогПатент";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.ТорговыйСбор Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.ТорговыйСбор";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Форма1Предприниматель Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма1Предприниматель";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Форма6НДФЛ Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Форма6НДФЛ";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СведенияОЗастрахованныхЛицах Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СведенияОЗастрахованныхЛицах";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Декларация12 Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Декларация12";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.Декларация8 Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.Декларация8";			
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.РасчетПоСтраховымВзносам Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.РасчетПоСтраховымВзносам";
		ИначеЕсли Задача = Справочники.ЗадачиКалендаряПодготовкиОтчетности.СЗВСтаж Тогда
			Возврат "Обработка.ОбработкиНалоговИОтчетности.Форма.СЗВСтаж";
		Иначе
			Возврат "";
		КонецЕсли;
	КонецЕсли;
	
КонецФункции


#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область ИнтерфейсКалендаряСотрудника

// Функция определяет пиктограмму для элемента записи календаря
//
// Параметры:
//  ЗаписьКалендаряПодготовкиОтчетности	 - СправочникСсылка.ЗаписьКалендаряПодготовкиОтчетности
// 
// Возвращаемое значение:
//  Картинка - пиктограмма записи календаря
//
Функция КартинкаЗаписиКалендаря(ЗаписьКалендаряПодготовкиОтчетности) Экспорт
	
	Возврат Новый Картинка;
	
КонецФункции

// Функция определяет цвет текста для элемента записи календаря
//
// Параметры:
//  ЗаписьКалендаряПодготовкиОтчетности	 - СправочникСсылка.ЗаписьКалендаряПодготовкиОтчетности
// 
// Возвращаемое значение:
//  Цвет - цвет текста записи календаря
//
Функция ЦветТекстаЗаписиКалендаря(ЗаписьКалендаряПодготовкиОтчетности) Экспорт
	
	Возврат Новый Цвет;
	
КонецФункции

// Процедура заполняет таблицу описаний расширенного ввода записи календаря
//
// Параметры:
//  ТаблицаОписаний	 - ТаблицаЗначений	 - описание колонок см. Справочник.ЗаписиКалендаряСотрудника.ПриЗаполненииРасширенногоВводаЗаписиКалендаря()
//
Процедура ПриЗаполненииРасширенногоВводаЗаписиКалендаря(ТаблицаОписаний) Экспорт
	
	// Запись календаря подготовки отчетности не редактируется пользователем
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
